================================
Declarations of variables
================================

a = 3

---

(source_file
  (expression (identifier) (factor))
)

========================================
Declarations of variables with semicolon
========================================

a = 3;

---

(source_file
  (expression (identifier) (factor))
)

========================================
Declarations of variables as computation
========================================

a = 3 * f;

---

(source_file
  (expression (identifier) (operation (factor) (factor (identifier))))
)

===================
Vector declarations
===================

a = [1 2 3;1, 2, 3];

---

(source_file
  (expression (identifier) (vector_definition (factor) (factor) (factor) (factor) (factor) (factor)))
)

==================
Vector as variable
==================

[t, k] = func();

---

(source_file
  (expression (vector_definition (factor (identifier)) (factor (identifier))) (factor (function_call (identifier) (argument_list))))
)

==============
Declare string
==============

a = '';
a = 'c';

---
(source_file
  (expression (identifier) (factor (string)))
  (expression (identifier) (factor (string))))

==============
Declare string vector
==============

a = ['b', 'c'];

---
(source_file
  (expression (identifier) (vector_definition (factor (string)) (factor (string)))))
